%% (4)-------------------------------------------------------
% clear;
% clc;
% % 定义传递函数
% s = tf('s'); % 定义复频率变量 s
% g0 = 200 * (1 + s) / ((1 + s) * (1 + 0.02 * s) * (1 + 5 * s) * (1 + 4 * s) + 2); % 传递函数 G(s)
% 
% % 绘制阶跃响应
% figure;
% step(g0); % 绘制阶跃响应
% grid on; % 添加网格
% title('系统的阶跃响应');
% xlabel('时间 (秒)');
% ylabel('幅值');
% legend('阶跃响应'); % 添加图例
% 
% % 绘制冲激响应
% figure;
% impulse(g0); % 绘制冲激响应
% grid on; % 添加网格
% title('系统的冲激响应');
% xlabel('时间 (秒)');
% ylabel('幅值');
% legend('冲激响应'); % 添加图例
% 
% % 利用 stepinfo 获取阶跃响应的动态性能指标
% info = stepinfo(g0);
% 
% % 显示阶跃响应的动态性能指标
% disp('系统阶跃响应的信息：');
% fprintf('上升时间 (Rise Time)：%.2f 秒\n', info.RiseTime);
% fprintf('峰值时间 (Peak Time)：%.2f 秒\n', info.PeakTime);
% fprintf('最大超调量 (Overshoot)：%.2f%%\n', info.Overshoot);
% fprintf('调整时间 (Settling Time)：%.2f 秒\n', info.SettlingTime);
%%-------------------------------------------------------

%% (5)-------------------------------------------------------
% clear;
% clc;
% 
% % 定义传递函数
% s = tf('s'); % 定义复频率变量 s
% g0 = 2 / ((1 + s) * (1 + 0.02 * s) * (1 + 5 * s) * (1 + 4 * s)); % 开环传递函数 G(s)
% 
% % 绘制开环系统的根轨迹
% figure;
% rlocus(g0); % 绘制根轨迹
% grid on; % 添加网格
% title('系统的根轨迹');
% xlabel('实部');
% ylabel('虚部');
%%-------------------------------------------------------

%% (6)-------------------------------------------------------
% clear;
% clc;
% 
% % 定义传递函数
% s = tf('s'); % 定义复频率变量 s
% g0 = 2 / ((1 + s) * (1 + 0.02 * s) * (1 + 5 * s) * (1 + 4 * s)); % 开环传递函数 G(s)
% 
% % 绘制 Nyquist 图
% figure;
% nyquist(g0); % 绘制 Nyquist 图
% title('系统的奈奎斯特图');
% xlabel('实部');
% ylabel('虚部');
%%-------------------------------------------------------

%% (7)-------------------------------------------------------
% clear;
% clc;
% 
% % 定义传递函数
% s = tf('s'); % 定义复频率变量 s
% g0 = 200 * (1 + s) / ((1 + s) * (1 + 0.02 * s) * (1 + 5 * s) * (1 + 4 * s)); % 开环传递函数 G(s)
% 
% % 绘制 Bode 图
% figure;
% bode(g0); % 绘制 Bode 图
% title('系统的波特图');
%%-------------------------------------------------------

%% (8)-------------------------------------------------------
clear;
clc;
% 定义传递函数
s = tf('s'); % 定义复频率变量 s
g0 = (26 * (6.5 * s + 1)*(1 + s) )/ ( s * (1 + s) * (1 + 0.02 * s) * (1 + 5 * s) * (1 + 4 * s) + 0.26 * ( 6.5 * s + 1)); % 传递函数 G(s)

% 绘制阶跃响应
figure;
step(g0); % 绘制阶跃响应
grid on; % 添加网格
title('新系统的阶跃响应');
xlabel('时间 (秒)');
ylabel('幅值');
legend('阶跃响应'); % 添加图例


% 利用 stepinfo 获取阶跃响应的动态性能指标
info = stepinfo(g0);

% 显示阶跃响应的动态性能指标
disp('新系统阶跃响应的信息：');
fprintf('上升时间 (Rise Time)：%.2f 秒\n', info.RiseTime);
fprintf('峰值时间 (Peak Time)：%.2f 秒\n', info.PeakTime);
fprintf('最大超调量 (Overshoot)：%.2f%%\n', info.Overshoot);
fprintf('调整时间 (Settling Time)：%.2f 秒\n', info.SettlingTime);

%%-------------------------------------------------------
